In [1]:
import pandas as pd

In [2]:
friends = [{'name':'John', 'age':15,'job':'student'},
          {'name':'Jenny','age':25,'job':'developer'},
          {'name':'Nate','age':30,'job':'teacher'}]

df = pd.DataFrame(friends, columns = ['name','age','job'])

In [3]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [12]:
df['salary'] = 0 # 새로운 열 추가

In [13]:
df

    name  age        job  salary
0   John   15    student       0
1  Jenny   25  developer       0
2   Nate   30    teacher       0

조건에 따라 값을 변경 numpy는 따로 학습할 예정

In [8]:
import numpy as np

In [9]:
df['salary'] = np.where(df['job'] != 'student','yes','no')

In [10]:
df

    name  age        job salary
0   John   15    student     no
1  Jenny   25  developer    yes
2   Nate   30    teacher    yes

## 열 추가하기

In [14]:
friends = [{'name':'John', 'midterm':78, 'final':89},
          {'name':'Jenny','midterm':88, 'final':88},
          {'name':'Nate','midterm':63, 'final':42}]

df = pd.DataFrame(friends, columns = ['name','midterm','final'])

In [15]:
df

    name  midterm  final
0   John       78     89
1  Jenny       88     88
2   Nate       63     42

In [16]:
df['total'] = df['midterm'] + df['final']

In [17]:
df

    name  midterm  final  total
0   John       78     89    167
1  Jenny       88     88    176
2   Nate       63     42    105

In [18]:
df['avg'] =df['total'] /2

In [19]:
df

    name  midterm  final  total   avg
0   John       78     89    167  83.5
1  Jenny       88     88    176  88.0
2   Nate       63     42    105  52.5

In [21]:
grades = []

for row in df['avg'] :
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [22]:
df

    name  midterm  final  total   avg grade
0   John       78     89    167  83.5     B
1  Jenny       88     88    176  88.0     B
2   Nate       63     42    105  52.5     F

In [25]:
def pass_or_fail(row) :
    if row != 'F':
        return "Pass"
    else :
        return "Fail"

In [26]:
df.grade = df.grade.apply(pass_or_fail) #.apply는 파라미터가 되는 것을 적용함

In [27]:
df

    name  midterm  final  total   avg grade
0   John       78     89    167  83.5  Pass
1  Jenny       88     88    176  88.0  Pass
2   Nate       63     42    105  52.5  Fail

### 데이터 가공하기

In [28]:
date_list = [
    {
        'yyyy-mm-dd' :'2000-06-27'
    },
    {
        'yyyy-mm-dd' :'2002-09-27'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [29]:
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-27

In [30]:
def extract_year(row):
    return row.split('-')[0]

In [31]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [32]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-27  2002

### 데이터 프레임 합치기

In [34]:
friends = [{'name':'John', 'midterm':78, 'final':89},
          {'name':'Jenny','midterm':88, 'final':88},
          {'name':'Nate','midterm':63, 'final':42}]

df = pd.DataFrame(friends, columns = ['name','midterm','final'])

In [35]:
df

    name  midterm  final
0   John       78     89
1  Jenny       88     88
2   Nate       63     42

In [36]:
df2 = pd.DataFrame([
        ['Ben',50,50]]
    ,columns =['name','midterm','final'] )

In [37]:
df2

  name  midterm  final
0  Ben       50     50

In [38]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       78     89
1  Jenny       88     88
2   Nate       63     42
3    Ben       50     50